Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: To increase the amount of indent in a line, use the ">" operator. Often this is used as ">>", which adds indent to the current line. The amount of indent added is specified with the 'shiftwidth' option. The default value is 8. To make ">>" insert four spaces worth of indent, for example, type this: >
es_es: Para aumentar la cantidad de sangrado en una línea, use el operador «>». A menudo usará esto como «>>», que añade sangrado a la línea actual. La cantidad de sangrado añadida se especifica con la opción 'shiftwidth'. El valor por omisión es 8. Para lograr que «>>» inserte cuatro espacios de sangrado, por ejemplo, use lo siguiente: >

source: the first line ~ the second line ~
es_es: la primera línea ~ la segunda línea ~

source: If you want to make indents a multiple of 4, you set 'shiftwidth' to 4. But when pressing a <Tab> you still get 8 spaces worth of indent. To change this, set the 'softtabstop' option: >
es_es: Si desea que el sangrado sea un múltiplo de 4, defina 'shiftwidth' a 4. Aún obtendría ocho espacios de sangrado al pulsar <Tab>. Defina la opción 'softtabstop' para modificar esto: >

source: This will make the <Tab> key insert 4 spaces worth of indent. If there are already four spaces, a <Tab> character is used (saving seven characters in the file). (If you always want spaces and no tab characters, set the 'expandtab' option.)
es_es: Esto hará que la tecla <Tab> inserte 4 espacios de sangrado. EL carácter <Tab> se usará en caso ya existir cuatro espacios (ahorrando 7 espacios en el archivo). (Si desea siempre espacios y no caracteres de tabulado, defina la opción 'expandtab').

source: Note: You could set the 'tabstop' option to 4. However, if you edit the file another time, with 'tabstop' set to the default value of 8, it will look wrong. In other programs and when printing the indent will also be wrong. Therefore it is recommended to keep 'tabstop' at eight all the time. That's the standard value everywhere.
es_es: Nota: Puede definir la opción 'tabstop' con valor de 4. De todas formas, si edita el archivo en otro momento teniendo 'tabstop' su valor predeterminado de 8, el aspecto no será el deseado. Otros programas, así como imprimir el sangrado presentarán un aspecto equivocado. Por ello, recomendamos mantener 'tabstop' con valor de 8 en todo momento. Este es el valor estándar en otras aplicaciones.

source: The ":retab" command will change 'tabstop' to 8, while changing the text such that it looks the same. It changes spans of white space into tabs and spaces for this. You can now write the file. Next time you edit it the indents will be right without setting an option. Warning: When using ":retab" on a program, it may change white space inside a string constant. Therefore it's a good habit to use "\t" instead of a real tab.
es_es: La orden «:retab» cambia 'tabstop' a 8, a la vez que modifica el texto para que encaje. Para ello, modifica los tramos de espacio blanco a tabulados y espacios. Ahora puede escribir en el archivo. La siguiente vez que lo edite, la tabulación será la correcta sin necesidad de definir la opción. Aviso: Si usa «:retab» sobre un programa, cabe que modifique el espacio en blanco dentro de una cadena entrecomillas. Por ello, es una buena costumbre usar «\t» en lugar de un tabulado real.

source: *25.4* Dealing with long lines
es_es: *25.4* Tratar líneas largas

source: If you don't have a scrollbar or don't want to use it, use these commands to scroll the text. The cursor will stay in the same place, but it's moved back into the visible text if necessary.
es_es: Si no tiene una barra de desplazamiento o no quiere usarla, puede usar estas órdenes para desplazar el texto. El cursor permanecerá en el mismo lugar, pero permitiendo también desplazarlo al texto visible, de ser necesario.

source: Let's attempt to show this with one line of text. The cursor is on the "w" of "which". The "current window" above the line indicates the text that is currently visible. The "window"s below the text indicate the text that is visible after the command left of it.
es_es: Vamos a intentar mostrar esto con una línea de texto. El cursor está sobre la «w» de «which». La «ventana actual» sobre la línea indica el texto actualmente visible. Las «ventana» bajo el texto indican el texto visible después de ejecutar la orden.

source: |<-- current window -->| some long text, part of which is visible in the window ~ ze |<-- window -->| zH |<-- window -->| 4zh |<-- window -->| zh |<-- window -->| zl |<-- window -->| 4zl |<-- window -->| zL |<-- window -->| zs |<-- window -->|
es_es: |<-- ventana actual -->| some long text, part of which is visible in the window ~ ze |<-- ventana -->| zH |<-- ventana -->| 4zh |<-- ventana -->| zh |<-- ventana -->| zl |<-- ventana -->| 4zl |<-- ventana -->| zL |<-- ventana -->| zs |<-- ventana -->|

source: When 'wrap' is off and the text has scrolled horizontally, you can use the following commands to move the cursor to a character you can see. Thus text left and right of the window is ignored. These never cause the text to scroll:
es_es: Cuando ha desplazado el texto horizontalmente y 'wrap' está desactivado, puede usar las siguientes órdenes para mover el cursor a un carácter que puede ver. Por ello, se ignorará el texto a la izquierda y derecha de la ventana. Esto nunca causa un desplazamiento del texto:

source: g0 to first visible character in this line g^ to first non-blank visible character in this line gm to middle of this line g$ to last visible character in this line
es_es: g0 Desplazarse al primer carácter en esta línea g^ Al primer carácter que no está en blanco de la línea gm Al centro de esta línea g$ Al ultimo carácter visible en esta línea

source: |<-- window -->| some long text, part of which is visible ~ g0 g^ gm g$
es_es: |<-- ventan -->| algún texto largo, parte del cual visible ~ g0 g^ gm g$

source: BREAKING AT WORDS *edit-no-break*
es_es: DIVIDIR LÍNEAS EN PALABRAS *edición-sin-partir* *edit-no-break*

source: When preparing text for use by another program, you might have to make paragraphs without a line break. A disadvantage of using 'nowrap' is that you can't see the whole sentence you are working on. When 'wrap' is on, words are broken halfway, which makes them hard to read. A good solution for editing this kind of paragraph is setting the 'linebreak' option. Vim then breaks lines at an appropriate place when displaying the line. The text in the file remains unchanged. Without 'linebreak' text might look like this:
es_es: Cuando prepara el texto para su uso con otro programa, puede que tenga que crear los párrafos sin salto de línea. Una desventaja de usar 'nowrap' es que no puede ver la oración completa sobre la que trabaja. Si 'wrap' está, activada, las palabras se dividen por la mitad, dificultando la lectura. Una buena solución para editar este tipo de párrafos es definir la opción 'linebreak'. Vim dividirá las líneas en los puntos apropiados al mostrar la línea. El texto en el archivo no se modifica. Sin 'linebreak', el texto presentará este aspecto:

source: +---------------------------------+ |letter generation program for a b| |ank. They wanted to send out a s| |pecial, personalized letter to th| |eir richest 1000 customers. Unfo| |rtunately for the programmer, he | +---------------------------------+ After: >
es_es: +---------------------------------+ |letter generation program for a b| |ank. They wanted to send out a s| |pecial, personalized letter to th| |eir richest 1000 customers. Unfo| |rtunately for the programmer, he | +---------------------------------+ Después: >

source: Related options: 'breakat' specifies the characters where a break can be inserted. 'showbreak' specifies a string to show at the start of broken line. Set 'textwidth' to zero to avoid a paragraph to be split.
es_es: Opciones relacionadas: 'breakat' especifica los caracteres donde insertar el salto de línea. 'showbreak' especifica una cadena a mostrar al principio de una línea dividida. Defina 'textwitdh' como cero para evitar dividir un párrafo.

source: The "j" and "k" commands move to the next and previous lines. When used on a long line, this means moving a lot of screen lines at once. To move only one screen line, use the "gj" and "gk" commands. When a line doesn't wrap they do the same as "j" and "k". When the line does wrap, they move to a character displayed one line below or above. You might like to use these mappings, which bind these movement commands to the cursor keys: >
es_es: Las órdenes «j» y «k» desplazan el cursor. Esto desplaza varias líneas en la pantalla en caso de usarlo sobre una larga línea. Para desplazarse sólo una línea en la pantalla, use las órdenes «gj» y «gk». Estas órdenes hacen lo mismo que «j» y «k» si la línea no está justificada. De activar 'wrap', se desplazan a un carácter visible en una línea inferior o superior. Puede que desee usar estas macros, que relacionan estas órdenes de desplazamiento a las teclas de cursor: >

source: If you want to import text into a program like MS-Word, each paragraph should be a single line. If your paragraphs are currently separated with empty lines, this is how you turn each paragraph into a single line: >
es_es: Si desea importar texto desde un programa como MS-Word, cada párrafo debería ser una sola línea. De existir una separación entre los párrafos en forma de de líneas vacías, debe realizar lo siguiente para convertir cada párrafo en una sola línea: >

source: That looks complicated. Let's break it up in pieces:
es_es: Parece complicado. Vamos a dividirlo:

source: :g/./ A ":global" command that finds all lines that contain at least one character. ,/^$/ A range, starting from the current line (the non-empty line) until an empty line. join The ":join" command joins the range of lines together into one line.
es_es: :g/./ Una orden «:global» que encuentra todas las cadenas que contienen al menos un carácter. ,/^$/ Un rango, que empieza en la línea actual (no vacía), y acaba en una línea vacía. join La orden «:join» (unir) une el rango de líneas en una sola línea.

source: Note that this doesn't work when the separating line is blank but not empty; when it contains spaces and/or tabs. This command does work with blank lines: > :g/\S/,/^\s*$/join
es_es: Tenga en cuenta que esto no funciona si la línea de separación está en blanco, pero no vacía; cuando contiene espacios y/o tabulados. Esta orden funciona con líneas en blanco: > :g/\S/,/^\s*$/join

source: *25.5* Editing tables
es_es: *25.5* Editar tablas

source: nice table test 1 test 2 test 3 ~ input A 0.534 ~ input B 0.913 ~
es_es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 ~ entrada B 0.913 ~

source: You need to enter numbers in the third column. You could move to the second line, use "A", enter a lot of spaces and type the text. For this kind of editing there is a special option: >
es_es: Necesita introducir números en la tercera columna. Podría desplazarse a la segunda línea, usar «A», introducir espacios y escribir el texto. Existe una orden especial para este tipo de edición: >

source: Now press "j" and you are right where you can enter the value for "input A". Typing "0.693" results in:
es_es: Pulse ahora «j» y estará dónde puede introducir el valor para «input A». Teclear «0.693» da como resultado:

source: nice table test 1 test 2 test 3 ~ input A 0.534 0.693 ~ input B 0.913 ~
es_es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 0.693 ~ entrada B 0.913 ~

source: Vim has automatically filled the gap in front of the new text for you. Now, to enter the next field in this column use "Bj". "B" moves back to the start of a white space separated word. Then "j" moves to the place where the next field can be entered.
es_es: Vim a rellenado automáticamente el espacio en frente del texto. Ahora, para introducir el siguiente campo de esta columna use «Bj». «B» le devuelve al inicio de una palabra separada por un espacio en blanco. «j» le desplaza al lugar dónde puede introducir el siguiente campo.

source: Note: You can move the cursor anywhere in the display, also beyond the end of a line. But Vim will not insert spaces there, until you insert a character in that position.
es_es: Nota: Puede mover el cursor a cualquier lugar de la pantalla, también más allá del final de línea. Pero Vim no insertará aquí espacios hasta que inserte un carácter en esa posición.

source: You want to add a column, which should be a copy of the third column and placed before the "test 1" column. Do this in seven steps: 1. Move the cursor to the left upper corner of this column, e.g., with "/test 3". 2. Press CTRL-V to start blockwise Visual mode. 3. Move the cursor down two lines with "2j". You are now in "virtual space": the "input B" line of the "test 3" column. 4. Move the cursor right, to include the whole column in the selection, plus the space that you want between the columns. "9l" should do it. 5. Yank the selected rectangle with "y". 6. Move the cursor to "test 1", where the new column must be placed. 7. Press "P".
es_es: Si desea añadir una columna, que debe ser la copia de la tercera columna y deberá situarse antes de la columna «test 1». Haga estos 7 pasos: 1. Mueva el cursor a la esquina superior izquierda de esta columna, p. ej., con «/test 3». 2. Pulse CTRL-V para empezar el modo de bloque visual. 3. Mueva el cursor dos líneas hacia abajo con «2j». Ahora se encuentra en espacio virtual («virtual space»): la línea «entrada B» de la columna «test 3». 4. Mueva el cursor a la derecha para incluir toda la columna en la selección además del espacio que desea entre las columnas. «9l» hará esto. 5. Copie el rectángulo seleccionado con «y» (yank). 6. Mueva el cursor a «test 1», donde se debería situar la nueva columna. 7. Pulse «P».

source: nice table test 3 test 1 test 2 test 3 ~ input A 0.693 0.534 0.693 ~ input B 0.913 ~
es_es: Tabla ordenada test 3 test 1 test 2 test 3 ~ entrada A 0.693 0.534 0.693 ~ entrada B 0.913 ~

source: The disadvantage of using 'virtualedit' is that it "feels" different. You can't recognize tabs or spaces beyond the end of line when moving the cursor around. Another method can be used: Virtual Replace mode. Suppose you have a line in a table that contains both tabs and other characters. Use "rx" on the first tab:
es_es: La desventaja de usar 'virtualedit' es que parece distinto. No puede reconocer tabulados o espacios más allá del final de línea si desplaza el cursor. Puede usar otro método: Modo Virtual de Reemplazar. Suponga que tiene una línea en una tabla que contienen tabulados y otros caracteres. Use «rx» en el primer tabulado:

source: The layout is messed up. To avoid that, use the "gr" command:
es_es: EL diseño está desordenado. Use la orden «gr» para evitarlo:

source: What happens is that the "gr" command makes sure the new character takes the right amount of screen space. Extra spaces or tabs are inserted to fill the gap. Thus what actually happens is that a tab is replaced by "x" and then blanks added to make the text after it keep its place. In this case a tab is inserted. When you need to replace more than one character, you use the "R" command to go to Replace mode (see |04.9|). This messes up the layout and replaces the wrong characters:
es_es: Lo que ocurre es que la orden «gr» se asegura que el nuevo carácter tomará la cantidad de espacio de pantalla correcta. Los espacios y tabulados adicionales se insertarán en el hueco. Por ello, lo que realmente ocurre es que el tabulado se reemplaza por «x», y después se añaden espacios en blanco para que el texto a continuación siga en el mismo sitio. En este caso se inserta un tabulado. Cuando necesita reemplazar más de un carácter, use la orden «R» para pasar al modo Reemplazar (consulte |04.9|). Esto desordena la presentación y reemplaza los caracteres erróneos:

source: The "gR" command uses Virtual Replace mode. This preserves the layout:
es_es: La orden «gR» usa el modo Virtual Reemplazar. Esto respeta el diseño:

source: *usr_09.txt* For Vim version 7.3. Last change: 2006 Apr 24
es_es: *usr_09.esx* Para Vim versión 7.3. Último cambio: 24/5/2006

source: Using the GUI
es_es: Uso de la interfaz gráfica (GUI)

source: Vim works in an ordinary terminal. GVim can do the same things and a few more. The GUI offers menus, a toolbar, scrollbars and other items. This chapter is about these extra things that the GUI offers.
es_es: Vim funciona en una terminal normal. GVim puede hacer las mismas cosas y algunas más. La interfaz gráfica ofrece menús, una barra de menú, barras de desplazamiento y otros. Este capítulo trata de las funcionalidades adicionales que la interfaz gráfica ofrece.

source: |09.1| Parts of the GUI |09.2| Using the mouse |09.3| The clipboard |09.4| Select mode
es_es: |09.1| Partes de la interfaz gráfica |09.2| Uso del ratón |09.3| El portapapeles |09.4| Modo Seleccionar

source: Next chapter: |usr_10.txt| Making big changes Previous chapter: |usr_08.txt| Splitting windows Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_10.esx| Realizar grandes cambios Capítulo anterior: |usr_08.esx| Dividir en ventanas Tabla de contenidos: |usr_toc.esx|

source: *09.1* Parts of the GUI
es_es: *09.1* Partes de la interfaz gráfica (GUI)

source: You might have an icon on your desktop that starts gVim. Otherwise, one of these commands should do it: >
es_es: Puede que tenga un icono en su escritorio que arranca gVim. En caso contrario, una de estas órdenes lo hará: >

source: gvim file.txt vim -g file.txt
es_es: gvim archivo.txt vim -g archivo.txt

source: If this doesn't work you don't have a version of Vim with GUI support. You will have to install one first. Vim will open a window and display "file.txt" in it. What the window looks like depends on the version of Vim. It should resemble the following picture (for as far as this can be shown in ASCII!).
es_es: Si esto no funciona es que no tiene la versión de Vim con soporte para GUI. Tendrá que instalar una primero. Vim abrirá una ventana y mostrará «archivo.txt». El aspecto de la ventana dependerá de la versión de Vim. Se debería parecer a la siguiente figura (¡tanto como se pueda parecer con texto ASCII!).

source: The largest space is occupied by the file text. This shows the file in the same way as in a terminal. With some different colors and another font perhaps.
es_es: El espacio más grande está ocupado por el archivo de texto. Esto muestra el archivo de una manera similar a una terminal. Con algunas diferencias de tipo de letra y color, quizá.

source: - The file cannot be modified (e.g., a help file) + The file contains changes = The file is read-only =+ The file is read-only, contains changes anyway
es_es: - El archivo no se puede modificar (por ej. la ayuda) + El archivo contiene cambios = El archivo es de sólo lectura =+ El archivo es de sólo lectura pero contiene cambios

source: You know how menus work, right? Vim has the usual items, plus a few more. Browse them to get an idea of what you can use them for. A relevant submenu is Edit/Global Settings. You will find these entries:
es_es: Ya sabe como funcionan los menús, ¿no? Vim tiene los elementos habituales, además de otros. Explórelos para tener una idea de cómo podría usarlos. Un submenú relevante es «Editar/Opciones globlales». Encontrará los siguientes elementos:

source: This contains icons for the most often used actions. Hopefully the icons are self-explanatory. There are tooltips to get an extra hint (move the mouse pointer to the icon without clicking and don't move it for a second).
es_es: Este contiene los iconos para las acciones más empleadas. La intención es que los iconos se expliquen a sí mismos. Hay globos de ayuda que le aconsejan (pon el puntero sobre un botón y no lo muevas durante un segundo).

source: The "Edit/Global Settings/Toggle Toolbar" menu item can be used to make the toolbar disappear. If you never want a toolbar, use this command in your vimrc file: >
es_es: La opción «Editar/Opciones globales/Ocultar/Mostrar barra de herramientas» se puede emplear para hacer que la barra de herramientas desaparezca. Si no desea tener una barra de herramientas en ningún momento, escriba esto en su «vimrc»: >

source: This removes the 'T' flag from the 'guioptions' option. Other parts of the GUI can also be enabled or disabled with this option. See the help for it.
es_es: Esto elimina la opción 'T' de la opción 'guioptions'. Otras partes de la interfaz gráfica se pueden también activar o desactivar del mismo modo. Consulte la ayuda.

source: By default there is one scrollbar on the right. It does the obvious thing. When you split the window, each window will get its own scrollbar. You can make a horizontal scrollbar appear with the menu item Edit/Global Settings/Toggle Bottom Scrollbar. This is useful in diff mode, or when the 'wrap' option has been reset (more about that later).
es_es: Por omisión sólo hay una barra de desplazamiento en la derecha. Hace lo que se espera de ella. Cada ventana tendrá su barra de desplazamiento. Puede hacer que una barra horizontal aparezca con la opción «Editar/ Opciones globales/Ocultar/Mostrar barra de desplazamiento inferior». Esto es útil en el modo diff, o cuando la opción 'wrap' está desactivada (eso lo veremos más adelante).

source: When there are vertically split windows, only the windows on the right side will have a scrollbar. However, when you move the cursor to a window on the left, it will be this one the that scrollbar controls. This takes a bit of time to get used to. When you work with vertically split windows, consider adding a scrollbar on the left. This can be done with a menu item, or with the 'guioptions' option: > :set guioptions+=l
es_es: Cuando hay ventanas divididas verticalmente, sólo las de la derecha tendrán barra de desplazamiento. Sin embargo, si mueve el cursor a una ventana en la izquierda, será esta la que la barra controle. Lleva cierto tiempo acostumbrarse a esto. Cuando trabaje con ventanas divididas verticalmente, considere la posibilidad de añadir barras en la izquierda. Pruebe con esta opción: > :set guioptions+=1

source: *09.2* Using the mouse
es_es: *09.2* Uso del ratón

source: Standards are wonderful. In Microsoft Windows, you can use the mouse to select text in a standard manner. The X Window system also has a standard system for using the mouse. Unfortunately, these two standards are not the same. Fortunately, you can customize Vim. You can make the behavior of the mouse work like an X Window system mouse or a Microsoft Windows mouse. The following command makes the mouse behave like an X Window mouse: >
es_es: Los estándares son maravillosos. En Microsoft Windows, puede usar el ratón para seleccionar texto de una forma estándar. El sistema de ventanas X Window System también tiene un estándar para el uso del ratón. Por desgracia, estos dos estándares no son compatibles. Afortunadamente, puede personalizarlo en Vim. Puede hacer que el comportamiento del ratón sea el mismo que bajo X o el de Windows. La siguiente orden hace que el ratón se comporte como bajo X: >

source: The default behavior of the mouse on UNIX systems is xterm. The default behavior on a Microsoft Windows system is selected during the installation process. For details about what the two behaviors are, see |:behave|. Here follows a summary.
es_es: El comportamiento predeterminado de un ratón en los sistemas UNIX es xterm. El comportamiento predeterminado en un sistema Windows se selecciona durante la instalación. Para más detalles sobre estos comportamientos, consulte |:behave|. Aquí tiene un pequeño resumen:
